recept/src/Documents/ВыпускПродукции/ВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыпускПродукции</name>
  <basedOn>Document.Рецептуры</basedOn>
  <registerRecords>AccumulationRegister.СтоимостьМатериалов</registerRecords>
  <registerRecords>InformationRegister.ЦеныМатериалов</registerRecords>
  <registerRecords>InformationRegister.СтатусПродукции</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Рецептуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>НаменованиеПродукции</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОбеспечения</name>
      <type>
        <types>EnumRef.СтатусыГотовностиПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

recept/src/Enums/СтатусыГотовностиПродукции/СтатусыГотовностиПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыГотовностиПродукции</name>
  <enumValues>
    <name>Заявка</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Брак</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
</mdclass:Enum>

recept/src/Documents/ВыпускПродукции/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)   
	Оповестить("Документ.ВыпускПродукции.Проведен", Объект.Ссылка, ЭтотОбъект); 
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияНаменованиеПродукцииПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Продукция.ТекущиеДанные;
	СтрокаТабличнойЧасти.СостояниеОбеспечения = ПредопределенноеЗначение("Перечисление.СтатусыГотовностиПродукции.ГотовКОтгрузке");
	Для каждого СтрокаТабличнойЧасти Из Объект.Продукция Цикл 
		СтрокаТабличнойЧасти.Остаток = РаботаСоСправочниками.ОстаткиМатериалов(СтрокаТабличнойЧасти.НаменованиеПродукции);
	КонецЦикла;
КонецПроцедуры
